---
kind: type
id: T:Autodesk.Revit.DB.WorksharingDisplaySettings
source: html/ec25e291-6582-7e8c-f273-efc0c391bcc4.htm
---
# Autodesk.Revit.DB.WorksharingDisplaySettings

WorksharingDisplaySettings controls how elements will appear when they are
 displayed in any of the worksharing display modes.

## Syntax (C#)
```csharp
public class WorksharingDisplaySettings : Element
```

## Remarks
The colors stored in these
 settings are a common setting and are shared by all users in the model. Whether
 a given color is applied or not is specific to the current user and will not
 be shared by other users.